OpenFOAM-v2106/tutorials/combustion/reactingFoam/RAS/DLR_A_LTS/0.orig/H2O
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2106                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      H2O;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.005008;

boundaryField
{
    inletfuel
    {
        type            fixedValue;
        value           uniform 0;
    }

    inletair
    {
        type            fixedValue;
        value           uniform 0.005008;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0.005008;
        value           uniform 0.005008;
    }

    axis
    {
        type            empty;
    }

    leftside
    {
        type            zeroGradient;
    }

    burnerwall
    {
        type            zeroGradient;
    }

    burnertip
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}


// ************************************************************************* //
